{
  "nombre_curso": "Curso IA",
  "modulos": [
    {
      "id": 1,
      "titulo": "Introducción del Curso",
      "contenido": "En este curso te ofrecemos una introducción completa al fascinante mundo de la Inteligencia Artificial (IA), comenzando por definiciones y un breve recorrido histórico que abarca desde sus inicios hasta avances recientes en Machine Learning y Deep Learning. Al completar este curso, podrás: Comprender la definición de IA, sus raíces históricas desde los años 30, y las diferentes clasificaciones según su capacidad, como la IA débil y la IA general. Te introducirás en el Machine Learning, un subcampo de la IA, entendiendo cómo las máquinas pueden aprender de los datos sin ser programadas explícitamente y conocerás los cuatro tipos principales de aprendizaje y los tipos de problemas. Descubrirás qué es el Deep Learning, su base en las Redes Neuronales Artificiales y la estructura básica de estas. Asimismo, entenderás el proceso de entrenamiento, evaluación e inferencia de estos modelos. Finalmente, abordaras los principios éticos cruciales para el desarrollo y uso responsable de la IA. En resumen, este curso te proporcionará una base sólida y comprensiva en Inteligencia Artificial, preparándote para entender su impacto actual y futuro, así como los desafíos éticos que plantea.",
      "submodulos": ""
    },      
    {
      "id": 2,
      "titulo": "¿Qué es la Inteligencia Artificial?",
      "contenido":"Este primer módulo te proporcionará una visión general y fundamental de la Inteligencia Artificial, sentando las bases para comprender los conceptos más avanzados que se abordarán en los módulos posteriores.",
      "submodulos": [
        {
          "id": "2.1",
          "titulo": "Introducción a la IA",
          "puntos": [
            {
              "id": "2.1.1",
              "titulo": "Definicion",
              "contenido": "Este primer módulo te proporcionará una visión general y fundamental de la Inteligencia Artificial, sentando las bases para comprender los conceptos más avanzados que se abordarán en los módulos posteriores.",
              "dinamicas": [
                {                    
                  "componente": "SlideShowingText",
                  "contenido": "Dar una definición exacta de Inteligencia artificial es sumamente difícil, debido a su complejidad y a su constante innovación, existen diferentes definiciones de diversos autores."
                },
                {                    
                  "componente": "SwipText",
                  "contenido": "A efectos de este curso, entenderemos como Inteligencia Artificial a la  disciplina científica y tecnológica que se encarga de crear y aplicar sistemas, máquinas, programas o dispositivos capaces de realizar tareas que comúnmente asociamos con la inteligencia humana. \nEjemplos de este tipo de tareas está el traducir de un idioma a otro, reconocer personas en una imagen, detectar y clasificar objetos según alguna característica, comprender un texto, e incluso tomar decisiones a partir de datos diversos"
                },
                {                    
                  "componente": "ShowScrollingText",
                  "contenido": [
                    "”La IA es la capacidad de las máquinas para usar algoritmos, aprender de los datos y utilizar lo aprendido en la toma de decisiones tal y como lo haría un ser humano.” \n Lasse Rouhiainen.",
                    "“La IA es una rama de las ciencias computacionales encargada de estudiar modelos de cómputo capaces de realizar actividades propias de los seres humanos en base a dos de sus características primordiales: el razonamiento y la conducta” \n Bruno López Takeyas.",
                    "“El estudio y desarrollo de sistemas informáticos que pueden copiar el comportamiento humano inteligente” \nDiccionario de Oxford",
                    "“Un sistema de IA es un sistema digital que procesa y analiza información en su entorno para actuar sobre él - con cierto grado de autonomía- con el fin de alcanzar objetivos específicos” \nUNESCO"
                  ]                    
                }                
              ]
            }
          ]
        },
        {
          "id": "2.2",
          "titulo": "Historia y evolución",
          "contenido": "Aunque es desde hace unos pocos años que la Inteligencia Artificial ha comenzado a popularizarse y a hacerse cada vez más cotidiana, la realidad es que es una disciplina que tiene sus inicios a finales de los años 1930 y principios de los 1940. A continuación presentamos una breve reseña de su historia y evolución",
          "puntos": [
            {
              "id": "2.2.1",
              "titulo": "",
              "contenido": "",                
              "dinamicas": [
                {
                  "componente": "Timeline",
                  "contenido": [
                    {
                      "id": 1,
                      "titulo": "Alan Turing",
                      "fecha": "1936",
                      "descripcionCorta": "Alan Turing presenta el concepto de la Máquina Universal, y se crea la \"Heath Robinson\"",
                      "descripcionLarga": "Ese año, el matemático británico Alan Turing ideó el concepto teórico de la \"Máquina Universal\", la cual es una máquina hipotética que, dadas unas entradas, un programa, y unas salidas, puede realizar cualquier cálculo que sea “algorítmicamente” posible. Esta máquina hipotética representó, hasta cierto punto, las bases teóricas de la computación moderna \nEn el marco de la Segunda Guerra Mundial, y con el propósito de descifrar los códigos del ejército alemán, se construyó y puso en práctica la máquina “Heath Robinson”, capaz de realizar operaciones lógicas y seguir instrucciones limitadas, la cual puede considerarse una verdadera precursora de las computadoras modernas."
                    },
                    {
                      "id": 2,
                      "titulo": "Warren McCulloch y Walters Pitts",
                      "fecha": "1943",
                      "descripcionCorta": "Warren McCulloch y Walters Pitts crean el modelo de neuronas artificiales.",
                      "descripcionLarga": "Los científicos estadounidenses Warren McCulloch y Walters  Pitts  crean el primer modelo de Red Neuronal Artificial (RNA). Este modelo es una estructura simplificada de las neuronas del cerebro humano con capas de entrada y salida."
                    },
                    {
                      "id": 3,
                      "titulo": "Turing",
                      "fecha": "1950",
                      "descripcionCorta": "Test de Turing.",
                      "descripcionLarga": "En su artículo “Computing machinery and intelligence”, Alan Turing planteó un experimento mental para evaluar si una máquina podría imitar el comportamiento o la inteligencia de un humano en una conversación.\nEn el hoy en día denominado “Test de Turing”, un evaluador humano interactúa mediante texto con dos entidades: una máquina y un humano, sin saber cuál es cuál. Si el evaluador no puede distinguir de manera consistente entre la máquina y el humano, se considera entonces que la máquina ha pasado el test y “demuestra” inteligencia artificial."
                    },
                    {
                      "id": 4,
                      "titulo": "Dartmouth",
                      "fecha": "1956",
                      "descripcionCorta": "Conferencia de Dartmouth.",
                      "descripcionLarga": "El término Inteligencia Artificial fue usado por primera vez en 1956 por el informático estadounidense John McCarthy en la Conferencia de Dartmouth (en inglés: Dartmouth Summer Research Project on Artificial Intelligence). El objetivo de la conferencia era reunir a intelectuales, científicos y demás expertos en el área, para discutir y desarrollar ideas sobre diferentes temas relacionados a las “Máquinas Pensantes”.\nEste evento, sin embargo, no produjo ningún avance notable, pero puso en contacto a las figuras más importantes de este campo, pero se puede afirmar que lo más relevante fue el consenso en adoptar el nuevo término."
                    },
                    {
                      "id": 5,
                      "titulo": "Primeros sistemas de IA",
                      "fecha": "60's y 70's",
                      "descripcionCorta": "Se desarrollan los primeros sistemas de IA.",
                      "descripcionLarga": "En estos momentos, gracias a los avances en algoritmos, hardware y técnicas de aprendizaje automático nacieron los primeros sistemas de IA como: \nThe Logic Theorist (o el Programa de Lógica), descrito como el primer programa de inteligencia artificial.\nELIZA, uno de los primeros programas de procesamiento del lenguaje natural.\nSHRDLU, este programa podía comprender el lenguaje natural y manipular objetos dentro de un mundo virtual limitado.\nDENDRAL, uno de los primeros sistemas expertos, utilizado en el análisis químico."
                    },
                    {
                      "id": 6,
                      "titulo": "Sistemas Expertos",
                      "fecha": "80's y 90's",
                      "descripcionCorta": "Surgen los Sistemas Expertos.",
                      "descripcionLarga": "Comienza el auge del aprendizaje automático, siendo uno de los primeros modelos los Sistemas expertos, los cuales usaban una base de conocimientos levantada por expertos en áreas específicas para imitar la toma de decisiones humana.\nSuper computadora Deep Blue revolucionó el mundo del ajedrez al vencer al campeón Garry Kasparov en 1997"
                    },
                    {
                      "id": 7,
                      "titulo": "Machine Learning",
                      "fecha": "2000's",
                      "descripcionCorta": "Machine Learning",
                      "descripcionLarga": "El aprendizaje automático o Machine Learning se consolida como una técnica indispensable dentro de los sistemas de IA, avanzando en temas como visión por computadora, robótica y procesamiento de lenguaje natural.\nAspiradora Automática Roomba: Este dispositivo de limpieza automático estaba equipado con sensores diseñados para sortear obstáculos, identificar zonas con acumulación de suciedad y evitar caídas por desniveles."
                    },
                    {
                      "id": 8,
                      "titulo": "Deep Learning",
                      "fecha": "2010",
                      "descripcionCorta": "Deep Learning",
                      "descripcionLarga": "En las últimas décadas, los avances en hardware especializado para el entrenamiento de redes neuronales, el fácil acceso a datos disponibles online y los bajos costos de servicios de etiquetado de datos, impulsaron el desarrollo de  algoritmos de aprendizaje profundo o Deep Learning.\nLa IA de Google, AlphaGo, vence al campeón mundial Ke Jie en el complejo juego de mesa de Go.\nAsistentes virtuales y reconocimiento de voz, como, Siri y Alexa, estos sistemas utilizan Redes Neuronales Recurrentes para comprender el lenguaje natural y generar una respuesta.\nLos sistemas de recomendación, como Netflix, Spotify, Amazon, emplean sistemas de recomendación para analizar las preferencias y sugerir contenido."
                    }
                  ]
                }                  
              ]
            }
          ]
        },
        {
          "id": "2.3",
          "titulo": "Tipos de IA",
          "contenido": "En esta sección del curso aprenderemos a distinguir las clasificaciones de la Inteligencia Artificial (IA) según su capacidad, dada la habilidad de los sistemas para resolver determinadas tareas, a continuación:",
          "puntos": [
            {
              "id": "2.3.1",
              "titulo": "",
              "contenido": "",                
              "dinamicas": [
                {
                  "componente": "SquareFlow",
                  "contenido": [
                    {
                      "titulo": "IA Estrecha o Débil",
                      "descipcion": "Está entrenada para realizar tareas muy específicas, y se enfoca en la resolución de problemas concretos de manera “inteligente”, como si fueran humanos.\nEsta inteligencia artificial constituye la mayor parte de la IA que nos rodea hoy en día."
                    },
                    {
                      "titulo": "IA Predictiva",
                      "descipcion": "La IA predictiva es aquella que, mediante el uso y análisis de datos estadísticos puede identificar patrones, anticipar comportamientos y prever próximos eventos."
                    },
                    {
                      "titulo": "IA Generativa",
                      "descipcion": "La IA generativa es aquella que está diseñada para generar diferentes contenidos (textos, imágenes, videos, audios, códigos) como respuesta a los requisitos del usuario."
                    }
                  ]
                },
                {
                  "componente": "Boxes",
                  "contenido":  [
                    {
                      "initialWords": [
                        {
                          "id": "1",
                          "text": "Finanzas",
                          "color": "color1",
                          "container": "available"
                        },
                        {
                          "id": "2",
                          "text": "Entretenimiento",
                          "color": "color2",
                          "container": "available"
                        },
                        {
                          "id": "3",
                          "text": "Salud",
                          "color": "color3",
                          "container": "available"
                        },
                        {
                          "id": "4",
                          "text": "Desarrollo de productos",
                          "color": "color4",
                          "container": "available"
                        },
                        {
                          "id": 5,
                          "text": "Arquitectura",
                          "color": "color1",
                          "container": "available"
                        },
                        {
                          "id": "6",
                          "text": "Música",
                          "color": "color2",
                          "container": "available"
                        },
                        {
                          "id": "7",
                          "text": "Escritura",
                          "color": "color3",
                          "container": "available"
                        },
                        {
                          "id": "8",
                          "text": "Arte",
                          "color": "color4",
                          "container": "available"
                        }
                      ]
                    },
                    {
                      "correctAnswers": [
                        {
                          "box1": [1, 2, 3],
                          "box2": [4, 5, 6, 7, 8]
                        }
                      ]
                    }
                  ]
                }                  
              ]
            }
          ]
        },
        {
          "id": "2.4",
          "titulo": "¿De qué está hecha la IA?",
          "contenido": "La Inteligencia Artificial no es un sistema que funcione por si solo, necesita de un conjunto de elementos que van desde la infraestructura que lo soporta hasta una gran cantidad de datos que demanda para poder cumplir con las tares que le fueron requeridas, los principales elementos requeridos son:",
          "puntos": [
            {
              "id": "2.4.1",
              "titulo": "",
              "contenido": "",                
              "dinamicas": [
                {
                  "componente": "Puzzle",
                  "contenido": [
                    {
                      "pieces":
                      [
                        {
                          "id": 1,
                          "titulo": "Datos e información",
                          "descripcion": "Valores crudos y datos procesados"
                        },
                        {
                          "id": 2,
                          "titulo": "Conocimiento",
                          "descripcion": "“Conjunto de habilidades e información que obtiene un individuo (o grupo) a través de la experiencia”."
                        },
                        {
                          "id": 3,
                          "titulo": "Inteligencia",
                          "descripcion": "“La capacidad de poder adquirir, asimilar, elaborar información y conocimiento, y, por sobre todo, usarlo adecuadamente para resolver problemas en el entorno en el que la entidad se desempeña”."
                        },
                        {
                          "id": 4,
                          "titulo": "Algoritmo",
                          "descripcion": "“Conjunto ordenado y finito de operaciones que permite hallar la solución de un problema”. RAE"
                        },
                        {
                          "id": 5,
                          "titulo": "Aprendizaje ",
                          "descripcion": "Adquisición de conocimiento a través de la práctica."
                        },
                        {
                          "id": 6,
                          "titulo": "Infraestructura",
                          "descripcion": "Conjunto de recursos o equipos de hardware (computadoras, servidores, switches, equipos de red procesadores, unidades de almacenamiento) que hacen posible la experimentación, entrenamiento y uso de modelos de IA."
                        }
                      ]
                    }
                    

                  ]
                }                  
              ]
            }
          ]
        },
        {
          "id": "2.5",
          "titulo": "Aplicaciones de la IA en la vida diaria",
          "contenido": "Ejemplos concretos y casos de uso: \nReconocimiento facial en teléfonos. \nRecomendaciones en redes sociales. \nMarketing digital basado en IA. \nDiagnóstico médico (detección de cáncer, evaluación de síntomas, entre otros). \nAsistentes Virtuales. \nVehículos Autónomos."
        },
        {
          "id": "2.6",
          "titulo": "Qué es y que no es IA",
          "contenido": "Responde SI o NO",
          "puntos": [
            {
              "id": "2.6.1",
              "titulo": "",
              "contenido": "",                
              "dinamicas": [
                {
                  "componente": "TestOpciones",
                  "contenido": [
                    {
                      "preguntasConRespuestas":[
                        {
                          "pregunta": "Un programa que te recomienda películas o series basado en tus reproducciones anteriores",
                          "respuestaCorrecta": "1"
                        },
                        {
                          "pregunta": "Dispositivos de realidad virtual",
                          "respuestaCorrecta": "2"
                        },
                        {
                          "pregunta": "Sistema de reconocimiento facial que desbloquea tu teléfono",
                          "respuestaCorrecta": "1"
                        },
                        {
                          "pregunta": "Robots de línea de ensamblaje",
                          "respuestaCorrecta": "2"
                        },
                        {
                          "pregunta": "Smart Watch",
                          "respuestaCorrecta": "2"
                        },
                        {
                          "pregunta": "Bots de aplicaciones de mensajería instantánea",
                          "respuestaCorrecta": "2"
                        },
                        {
                          "pregunta": "Filtros de redes sociales",
                          "respuestaCorrecta": "1"
                        },
                        {
                          "pregunta": "Semáforos “inteligentes”",
                          "respuestaCorrecta": "2"
                        }
                      ]
                    }
                  ]
                }                  
              ]
            }
          ]
        }
      ]
    }
  ]
}